week-05/moma/app/views/artists/show.html.erb

SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 12]]
---

<% @artist.works.each do |work|%>