week-05/moma/app/controllers/artists_controller.rb

    def show
        @artist= Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jonny "], ["nationality", "Australian"], ["period", "Marketing"], ["image", ""], ["created_at", "2021-10-20 01:43:16.326819"], ["updated_at", "2021-10-20 01:43:16.326819"]]

    def edit
        @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def update
        artist = Artist.find params[:id]
        artist.update artist_params
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "period" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["period", " Early 20th century"], ["updated_at", "2021-10-20 03:18:45.626637"], ["id", 1]]

    def destroy
        artist = Artist.find params[:id]
        artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 9]]