week-05/moma/app/controllers/works_controller.rb

    def index
        @works = Work.all
---
SELECT "works".* FROM "works"

    def show
        @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def create
        work  = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "C sharp"], ["year", "1930"], ["medium", ""], ["style", ""], ["image", ""], ["created_at", "2021-10-20 05:20:52.225983"], ["updated_at", "2021-10-20 05:20:52.225983"]]

    def edit
        @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        work = Work.find params[:id]
        work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "works" SET "year" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["year", "1929 to"], ["updated_at", "2021-10-20 04:25:24.108288"], ["id", 1]]

    def destroy
        work = Work.find params[:id]
        work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 1]]